宿題７
国ごとの都市数をカウント
かつ　数字が大きい順に並べる
ヒント）group by、order by

In [1]:
import sqlite3
import pandas as pd
con = sqlite3.connect("sakila.db")

In [7]:
sql_query = '''SELECT country, city, COUNT(city) FROM country LEFT OUTER JOIN city ON country.country_id = city.country_id GROUP BY country ORDER BY COUNT(city) DESC'''

In [8]:
df = pd.read_sql(sql_query, con)

df

                  country              city  COUNT(city)
0                   India             Adoni           60
1                   China          Baicheng           53
2           United States             Akron           35
3                   Japan          Akishima           31
4                  Mexico              Acua           30
..                    ...               ...          ...
104               Tunisia            Sousse            1
105          Turkmenistan          Ashgabat            1
106                Tuvalu          Funafuti            1
107  Virgin Islands, U.S.  Charlotte Amalie            1
108                Zambia             Kitwe            1

[109 rows x 3 columns]